Comp250/midterm-review.org
#+title: Midterm I, Review I: Easy Bullshit That Should be Even Easier
#+OPTIONS: tex:t
#+HTML_MATHJAX: t


* Review 1
** Problem 1
Grading midterms is hard and we want to automate it.
Suppose we want to ask “for what x does x2 = 12 ?” and grade your answer automatically. We provide
you with a text-box to type in your answer. We then take your answer, convert it to a double
studentAnswer, and provide it to the following function isCorrect to check if it’s correct.
There’s two big flaws with this function. What are they? Write us a better version.
#+BEGIN_SRC java
boolean isCorrect(double studentAnswer) {
        double correctAnswer = Math.sqrt(1/2);
        return studentAnswer == correctAnswer;
}
#+END_SRC

*** Answer
- The two big flaws are as follows:
  1. The function doesn't account for the student answer being negative
  2. The function tries to compare doubles directly, which won't work, especially with irrational numbers. You would need to compare the difference of the doubles to an arbitrarily small value like .001
How would I write this code?
#+BEGIN_SRC java
boolean isCorrect (double studentAnswer) {
    double correctAnswer = Math.sqrt(1/2);
    double difference = correctAnswer - Math.abs(studentAnswer);
    return Math.abs(difference) < .01;
}
#+END_SRC

** Problem 2
 Write the code that would replace ***BLANK_ONE*** and ***BLANK_TWO*** respectively to complete
the method findNextLargest(int upperBound,int[] array). The purpose of this method is to find
the position (i.e. the index) of the largest element inside array that is upper bounded by upperBound
(i.e. it is strictly lower than upperBound). You can assume that the input array contains at least one
such element. In case of ties, the method returns the largest between the indices.
#+BEGIN_SRC java
public static int findNextLargest(int upperBound, int[] array){
        int largest=0;
        for (int i=0; i<array.length;i++){
                if ( ***BLANK_ONE*** ){
                ***BLANK_TWO***
                }
        }
        return largest;
}
#+END_SRC

*** Answer
+ BLANK ONE
#+BEGIN_SRC java
array[i] > array[largest] && array[i] < upperBound
#+END_SRC
+ BLANK TWO
#+BEGIN_SRC java
largest = i;
#+END_SRC



** Problem 3
Assume inside a package called midterm there is only one file named Midterm.java and this file contains
only one Java class called Midterm.
#+BEGIN_SRC java
Galaxy andromeda = new Galaxy(“Galaxy A”);
double stars = andromeda.numOfStars;
#+END_SRC
Assuming that the statements above from the main method of the class Midterm compile and run
without any errors, write three properties you can infer to be true about the class Galaxy and its
members.

*** Answer
1. Galaxy class has a public, non static field called numOfStars
2. One of the Galaxy class's constructors takes a string as a parameter
3. numOfStars is initialized with a value in the constructor, or else it would have to be static


** Problem 4
Suppose Strings A and B have the same hashCode. What does this tell us about A and B?

*** Answer
This means that the strings could be the same value, or they could just coincedentally have the same hash code. There are infinitely many strings and a finite amount of hash codes


