Comp250/midterm-review.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2024-10-06 Sun 02:29 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Midterm Review</title>
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">Midterm Review</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#orga83ac30">1. Review 1</a>
<ul>
<li><a href="#org0837b0c">1.1. Problem 1</a>
<ul>
<li><a href="#orgccbeb7c">1.1.1. Answer</a></li>
</ul>
</li>
<li><a href="#org23f3c8d">1.2. Problem 2</a>
<ul>
<li><a href="#org85e4f17">1.2.1. Answer</a></li>
</ul>
</li>
<li><a href="#org1ba3ce9">1.3. Problem 3</a>
<ul>
<li><a href="#org031f87e">1.3.1. Answer</a></li>
</ul>
</li>
<li><a href="#orgce69fd6">1.4. Problem 4</a>
<ul>
<li><a href="#org0f6be6c">1.4.1. Answer</a></li>
</ul>
</li>
<li><a href="#org28a41cc">1.5. Problem 5</a>
<ul>
<li><a href="#org05a5c48">1.5.1. Answer</a></li>
</ul>
</li>
<li><a href="#org883df4b">1.6. Problem 6</a>
<ul>
<li><a href="#org6ee63e5">1.6.1. Answer</a></li>
</ul>
</li>
<li><a href="#orgdd04c77">1.7. Problem 7</a></li>
<li><a href="#org922968b">1.8. Problem 8</a>
<ul>
<li><a href="#orge0a055c">1.8.1. Answer</a></li>
</ul>
</li>
<li><a href="#org2341c53">1.9. Problem 9</a>
<ul>
<li><a href="#orge6e1c39">1.9.1. Answer</a></li>
</ul>
</li>
<li><a href="#org0549e08">1.10. Problem 10</a>
<ul>
<li><a href="#org98b4a45">1.10.1. Answer</a></li>
</ul>
</li>
<li><a href="#orgbf943eb">1.11. Problem 11</a></li>
<li><a href="#org1abdb04">1.12. Problem 12</a>
<ul>
<li><a href="#orgd484b86">1.12.1. Answer</a></li>
</ul>
</li>
<li><a href="#orgb8d8bcc">1.13. Problem 13</a>
<ul>
<li><a href="#org29e5d73">1.13.1. Answer</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-orga83ac30" class="outline-2">
<h2 id="orga83ac30"><span class="section-number-2">1.</span> Review 1</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-org0837b0c" class="outline-3">
<h3 id="org0837b0c"><span class="section-number-3">1.1.</span> Problem 1</h3>
<div class="outline-text-3" id="text-1-1">
<p>
Grading midterms is hard and we want to automate it.
Suppose we want to ask “for what x does x2 = 12 ?” and grade your answer automatically. We provide
you with a text-box to type in your answer. We then take your answer, convert it to a double
studentAnswer, and provide it to the following function isCorrect to check if it’s correct.
There’s two big flaws with this function. What are they? Write us a better version.
</p>
<div class="org-src-container">
<pre class="src src-java"><span style="color: #ECBE7B;">boolean</span> <span style="color: #c678dd;">isCorrect</span><span style="color: #51afef;">(</span><span style="color: #ECBE7B;">double</span> <span style="color: #dcaeea;">studentAnswer</span><span style="color: #51afef;">)</span> <span style="color: #51afef;">{</span>
        <span style="color: #ECBE7B;">double</span> <span style="color: #dcaeea;">correctAnswer</span> = Math.sqrt<span style="color: #c678dd;">(</span><span style="color: #da8548; font-weight: bold;">1</span>/<span style="color: #da8548; font-weight: bold;">2</span><span style="color: #c678dd;">)</span>;
        <span style="color: #51afef;">return</span> studentAnswer == correctAnswer;
<span style="color: #51afef;">}</span>
</pre>
</div>
</div>
<div id="outline-container-orgccbeb7c" class="outline-4">
<h4 id="orgccbeb7c"><span class="section-number-4">1.1.1.</span> Answer</h4>
<div class="outline-text-4" id="text-1-1-1">
<ul class="org-ul">
<li>The two big flaws are as follows:
<ol class="org-ol">
<li>The function doesn&rsquo;t account for the student answer being negative</li>
<li>The function tries to compare doubles directly, which won&rsquo;t work, especially with irrational numbers. You would need to compare the difference of the doubles to an arbitrarily small value like .001</li>
</ol></li>
</ul>
<p>
How would I write this code?
</p>
<div class="org-src-container">
<pre class="src src-java"><span style="color: #ECBE7B;">boolean</span> <span style="color: #c678dd;">isCorrect</span> <span style="color: #51afef;">(</span><span style="color: #ECBE7B;">double</span> <span style="color: #dcaeea;">studentAnswer</span><span style="color: #51afef;">)</span> <span style="color: #51afef;">{</span>
    <span style="color: #ECBE7B;">double</span> <span style="color: #dcaeea;">correctAnswer</span> = Math.sqrt<span style="color: #c678dd;">(</span><span style="color: #da8548; font-weight: bold;">1</span>/<span style="color: #da8548; font-weight: bold;">2</span><span style="color: #c678dd;">)</span>;
    <span style="color: #ECBE7B;">double</span> <span style="color: #dcaeea;">difference</span> = correctAnswer - Math.abs<span style="color: #c678dd;">(</span>studentAnswer<span style="color: #c678dd;">)</span>;
    <span style="color: #51afef;">return</span> Math.abs<span style="color: #c678dd;">(</span>difference<span style="color: #c678dd;">)</span> &lt; .<span style="color: #da8548; font-weight: bold;">01</span>;
<span style="color: #51afef;">}</span>
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-org23f3c8d" class="outline-3">
<h3 id="org23f3c8d"><span class="section-number-3">1.2.</span> Problem 2</h3>
<div class="outline-text-3" id="text-1-2">
<p>
 Write the code that would replace <b><b><b>BLANK<sub>ONE</sub></b></b></b> and <b><b><b>BLANK<sub>TWO</sub></b></b></b> respectively to complete
the method findNextLargest(int upperBound,int[] array). The purpose of this method is to find
the position (i.e. the index) of the largest element inside array that is upper bounded by upperBound
(i.e. it is strictly lower than upperBound). You can assume that the input array contains at least one
such element. In case of ties, the method returns the largest between the indices.
</p>
<div class="org-src-container">
<pre class="src src-java"><span style="color: #51afef;">public</span> <span style="color: #51afef;">static</span> <span style="color: #ECBE7B;">int</span> <span style="color: #c678dd;">findNextLargest</span><span style="color: #51afef;">(</span><span style="color: #ECBE7B;">int</span> <span style="color: #dcaeea;">upperBound</span>, <span style="color: #ECBE7B;">int</span><span style="color: #c678dd;">[]</span> <span style="color: #dcaeea;">array</span><span style="color: #51afef;">){</span>
        <span style="color: #ECBE7B;">int</span> <span style="color: #dcaeea;">largest</span>=<span style="color: #da8548; font-weight: bold;">0</span>;
        <span style="color: #51afef;">for</span> <span style="color: #c678dd;">(</span><span style="color: #ECBE7B;">int</span> <span style="color: #dcaeea;">i</span>=<span style="color: #da8548; font-weight: bold;">0</span>; i&lt;array.<span style="color: #ECBE7B;">length</span>;i++<span style="color: #c678dd;">){</span>
                <span style="color: #51afef;">if</span> <span style="color: #98be65;">(</span> ***BLANK_ONE*** <span style="color: #98be65;">){</span>
                ***BLANK_TWO***
                <span style="color: #98be65;">}</span>
        <span style="color: #c678dd;">}</span>
        <span style="color: #51afef;">return</span> largest;
<span style="color: #51afef;">}</span>
</pre>
</div>
</div>
<div id="outline-container-org85e4f17" class="outline-4">
<h4 id="org85e4f17"><span class="section-number-4">1.2.1.</span> Answer</h4>
<div class="outline-text-4" id="text-1-2-1">
<ul class="org-ul">
<li>BLANK ONE</li>
</ul>
<div class="org-src-container">
<pre class="src src-java">array<span style="color: #51afef;">[</span>i<span style="color: #51afef;">]</span> &gt; array<span style="color: #51afef;">[</span>largest<span style="color: #51afef;">]</span> &amp;&amp; array<span style="color: #51afef;">[</span>i<span style="color: #51afef;">]</span> &lt; upperBound
</pre>
</div>
<ul class="org-ul">
<li>BLANK TWO</li>
</ul>
<div class="org-src-container">
<pre class="src src-java">largest = i;
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-org1ba3ce9" class="outline-3">
<h3 id="org1ba3ce9"><span class="section-number-3">1.3.</span> Problem 3</h3>
<div class="outline-text-3" id="text-1-3">
<p>
Assume inside a package called midterm there is only one file named Midterm.java and this file contains
only one Java class called Midterm.
</p>
<div class="org-src-container">
<pre class="src src-java"><span style="color: #ECBE7B;">Galaxy</span> <span style="color: #dcaeea;">andromeda</span> = <span style="color: #51afef;">new</span> <span style="color: #ECBE7B;">Galaxy</span><span style="color: #51afef;">(</span>&#8220;Galaxy A&#8221;<span style="color: #51afef;">)</span>;
<span style="color: #ECBE7B;">double</span> <span style="color: #dcaeea;">stars</span> = andromeda.numOfStars;
</pre>
</div>
<p>
Assuming that the statements above from the main method of the class Midterm compile and run
without any errors, write three properties you can infer to be true about the class Galaxy and its
members.
</p>
</div>
<div id="outline-container-org031f87e" class="outline-4">
<h4 id="org031f87e"><span class="section-number-4">1.3.1.</span> Answer</h4>
<div class="outline-text-4" id="text-1-3-1">
<ol class="org-ol">
<li>Galaxy class has a public, non static field called numOfStars</li>
<li>One of the Galaxy class&rsquo;s constructors takes a string as a parameter</li>
<li>numOfStars is initialized with a value in the constructor, or else it would have to be static</li>
</ol>
</div>
</div>
</div>
<div id="outline-container-orgce69fd6" class="outline-3">
<h3 id="orgce69fd6"><span class="section-number-3">1.4.</span> Problem 4</h3>
<div class="outline-text-3" id="text-1-4">
<p>
Suppose Strings A and B have the same hashCode. What does this tell us about A and B?
</p>
</div>
<div id="outline-container-org0f6be6c" class="outline-4">
<h4 id="org0f6be6c"><span class="section-number-4">1.4.1.</span> Answer</h4>
<div class="outline-text-4" id="text-1-4-1">
<p>
This means that the strings could be the same value, or they could just coincedentally have the same hash code. There are infinitely many strings and a finite amount of hash codes
</p>
</div>
</div>
</div>
