Comp250/midterm-review.org
** Problem 5
Suppose you’re given the following two classes.
#+BEGIN_SRC java
public class Person {
        public double mass;
        public Person(double mass) {
                this.mass = mass;
        }
}
public class Planet {
        private double gravity;
        public Planet(double gravity) {
            this.gravity = gravity;
        }
}
// Returns the effective weight of Person person on this planet
public double calculateWeight(Person person) {
    return person.mass * this.gravity;
}
#+END_SRC
(a) Write a new method weightOn in the Person that enables the following code snippet to compile
and print the values 0.6 and 600 as desired.

#+BEGIN_SRC java
public static void main(String[] args) {
        Person bob = new Person(60);
        Planet pluto = new Planet(0.01);
        Planet jupiter = new Planet(10);
        System.out.println(bob.weightOn(pluto));
        System.out.println(bob.weightOn(jupiter));
}
#+END_SRC
(b) What is the type of this inside the body of calculateWeight?

*** Answer
a. Here is my implementation
   #+BEGIN_SRC java
   public double weightOn (Planet x) {
        return x.calculateWeight (this);
   }
   #+END_SRC
b. *this* is memeber of the Planet data type



** Problem 6
/Too long, see PDF for the question/

*** Answer
a. Candy would be considered an immutable data type, since it has all private fields and no setters. CandyStore follows the same structure (no setters, all private fields) so it is also immuatble
b. My implementation is below:
   #+BEGIN_SRC java
   this.candies[i].equals (c)
   #+END_SRC
c. getSourCandies is a static function associated with the Candy data type; Below is my implementation:
   #+BEGIN_SRC java
public static Candy[] getSourCandies (String OOPsux, int whyDoesEeveryFunctionNeedAnAssociatedDataType);
   #+END_SRC
d. Below is my implementation:
#+BEGIN_SRC java
candies[i].isChewier (c)
#+END_SRC


** Problem 7
/Skipped because it was UML, come back tmr/


** Problem 8
/Requires a UML diagram, see PDF/

*** Answer
return super.getPreptime() + Topping.getPrepTime;


** Problem 9
Considering what you know about the internal implementation of ArrayList in Java, how many objects
are created in the following lines of code?
#+BEGIN_SRC java
ArrayList<Wizard> slytherin = new Arraylist<Wizard>();
slytherin.add(new Wizard(18,”Draco”));
Integer age = 180;
slytherin.add(new Wizard(age, “youknowwho”));
#+END_SRC
*** Answer
Assuming everything about ArrayLists (missed this lecture), I would assume there is an object of ArrayList, a head and a tail. It also has the object within the list, so 4 in total.

** Problem 10
Using the method above, fill in the missing expressions/statements below for a method in SLinkedList
that takes no inputs, traverses the list, and swaps pairs of elements. For example, if the list had the
following elements A B C D E F G, then after the method has been executed, the list will contain the
elements in the following order B A D C F E G. The method should work no matter the size of the list.
Note that the method does not return anything, it just performs all the swaps. The time complexity
for this method should be O(n), where n is the number of elements in the list (i.e. the number of basic
steps to execute is proportional to the number of elements in the list).
#+BEGIN_SRC java
public void swapPairs(){
        SNode node = this.head;
        while ( ***BLANK1*** ) {
                ***BLANK2***
                ***BLANK3***
        }
}
#+END_SRC
