Comp250/midterm-review.html
<div id="outline-container-org28a41cc" class="outline-3">
<h3 id="org28a41cc"><span class="section-number-3">1.5.</span> Problem 5</h3>
<div class="outline-text-3" id="text-1-5">
<p>
Suppose you’re given the following two classes.
</p>
<div class="org-src-container">
<pre class="src src-java"><span style="color: #51afef;">public</span> <span style="color: #51afef;">class</span> <span style="color: #ECBE7B;">Person</span> <span style="color: #51afef;">{</span>
        <span style="color: #51afef;">public</span> <span style="color: #ECBE7B;">double</span> <span style="color: #dcaeea;">mass</span>;
        <span style="color: #51afef;">public</span> Person<span style="color: #c678dd;">(</span><span style="color: #ECBE7B;">double</span> <span style="color: #dcaeea;">mass</span><span style="color: #c678dd;">)</span> <span style="color: #c678dd;">{</span>
                <span style="color: #51afef;">this</span>.mass = mass;
        <span style="color: #c678dd;">}</span>
<span style="color: #51afef;">}</span>
<span style="color: #51afef;">public</span> <span style="color: #51afef;">class</span> <span style="color: #ECBE7B;">Planet</span> <span style="color: #51afef;">{</span>
        <span style="color: #51afef;">private</span> <span style="color: #ECBE7B;">double</span> <span style="color: #dcaeea;">gravity</span>;
        <span style="color: #51afef;">public</span> Planet<span style="color: #c678dd;">(</span><span style="color: #ECBE7B;">double</span> <span style="color: #dcaeea;">gravity</span><span style="color: #c678dd;">)</span> <span style="color: #c678dd;">{</span>
            <span style="color: #51afef;">this</span>.gravity = gravity;
        <span style="color: #c678dd;">}</span>
<span style="color: #51afef;">}</span>
<span style="color: #5B6268;">// </span><span style="color: #5B6268;">Returns the effective weight of Person person on this planet</span>
<span style="color: #51afef;">public</span> <span style="color: #ECBE7B;">double</span> <span style="color: #c678dd;">calculateWeight</span><span style="color: #51afef;">(</span><span style="color: #ECBE7B;">Person</span> <span style="color: #dcaeea;">person</span><span style="color: #51afef;">)</span> <span style="color: #51afef;">{</span>
    <span style="color: #51afef;">return</span> person.mass * <span style="color: #51afef;">this</span>.gravity;
<span style="color: #51afef;">}</span>
</pre>
</div>
<p>
(a) Write a new method weightOn in the Person that enables the following code snippet to compile
and print the values 0.6 and 600 as desired.
</p>

<div class="org-src-container">
<pre class="src src-java"><span style="color: #51afef;">public</span> <span style="color: #51afef;">static</span> <span style="color: #ECBE7B;">void</span> <span style="color: #c678dd;">main</span><span style="color: #51afef;">(</span><span style="color: #ECBE7B;">String</span><span style="color: #c678dd;">[]</span> <span style="color: #dcaeea;">args</span><span style="color: #51afef;">)</span> <span style="color: #51afef;">{</span>
        <span style="color: #ECBE7B;">Person</span> <span style="color: #dcaeea;">bob</span> = <span style="color: #51afef;">new</span> <span style="color: #ECBE7B;">Person</span><span style="color: #c678dd;">(</span><span style="color: #da8548; font-weight: bold;">60</span><span style="color: #c678dd;">)</span>;
        <span style="color: #ECBE7B;">Planet</span> <span style="color: #dcaeea;">pluto</span> = <span style="color: #51afef;">new</span> <span style="color: #ECBE7B;">Planet</span><span style="color: #c678dd;">(</span><span style="color: #da8548; font-weight: bold;">0.01</span><span style="color: #c678dd;">)</span>;
        <span style="color: #ECBE7B;">Planet</span> <span style="color: #dcaeea;">jupiter</span> = <span style="color: #51afef;">new</span> <span style="color: #ECBE7B;">Planet</span><span style="color: #c678dd;">(</span><span style="color: #da8548; font-weight: bold;">10</span><span style="color: #c678dd;">)</span>;
        System.out.println<span style="color: #c678dd;">(</span>bob.weightOn<span style="color: #98be65;">(</span>pluto<span style="color: #98be65;">)</span><span style="color: #c678dd;">)</span>;
        System.out.println<span style="color: #c678dd;">(</span>bob.weightOn<span style="color: #98be65;">(</span>jupiter<span style="color: #98be65;">)</span><span style="color: #c678dd;">)</span>;
<span style="color: #51afef;">}</span>
</pre>
</div>
<p>
(b) What is the type of this inside the body of calculateWeight?
</p>
</div>
<div id="outline-container-org05a5c48" class="outline-4">
<h4 id="org05a5c48"><span class="section-number-4">1.5.1.</span> Answer</h4>
<div class="outline-text-4" id="text-1-5-1">
<ol class="org-ol">
<li><p>
Here is my implementation
</p>
<div class="org-src-container">
<pre class="src src-java">   <span style="color: #51afef;">public</span> <span style="color: #ECBE7B;">double</span> <span style="color: #c678dd;">weightOn</span> <span style="color: #51afef;">(</span><span style="color: #ECBE7B;">Planet</span> <span style="color: #dcaeea;">x</span><span style="color: #51afef;">)</span> <span style="color: #51afef;">{</span>
        <span style="color: #51afef;">return</span> x.calculateWeight <span style="color: #c678dd;">(</span><span style="color: #51afef;">this</span><span style="color: #c678dd;">)</span>;
   <span style="color: #51afef;">}</span>
</pre>
</div></li>
<li><b>this</b> is memeber of the Planet data type</li>
</ol>
</div>
</div>
</div>
<div id="outline-container-org883df4b" class="outline-3">
<h3 id="org883df4b"><span class="section-number-3">1.6.</span> Problem 6</h3>
<div class="outline-text-3" id="text-1-6">
<p>
<i>Too long, see PDF for the question</i>
</p>
</div>
<div id="outline-container-org6ee63e5" class="outline-4">
<h4 id="org6ee63e5"><span class="section-number-4">1.6.1.</span> Answer</h4>
<div class="outline-text-4" id="text-1-6-1">
<ol class="org-ol">
<li>Candy would be considered an immutable data type, since it has all private fields and no setters. CandyStore follows the same structure (no setters, all private fields) so it is also immuatble</li>
<li><p>
My implementation is below:
</p>
<div class="org-src-container">
<pre class="src src-java">   <span style="color: #51afef;">this</span>.candies<span style="color: #51afef;">[</span>i<span style="color: #51afef;">]</span>.equals <span style="color: #51afef;">(</span>c<span style="color: #51afef;">)</span>
</pre>
</div></li>
<li><p>
getSourCandies is a static function associated with the Candy data type; Below is my implementation:
</p>
<div class="org-src-container">
<pre class="src src-java"><span style="color: #51afef;">public</span> <span style="color: #51afef;">static</span> <span style="color: #ECBE7B;">Candy</span><span style="color: #51afef;">[]</span> <span style="color: #c678dd;">getSourCandies</span> <span style="color: #51afef;">(</span><span style="color: #ECBE7B;">String</span> <span style="color: #dcaeea;">OOPsux</span>, <span style="color: #ECBE7B;">int</span> <span style="color: #dcaeea;">whyDoesEeveryFunctionNeedAnAssociatedDataType</span><span style="color: #51afef;">)</span>;
</pre>
</div></li>
<li>Below is my implementation:</li>
</ol>
<div class="org-src-container">
<pre class="src src-java">candies<span style="color: #51afef;">[</span>i<span style="color: #51afef;">]</span>.isChewier <span style="color: #51afef;">(</span>c<span style="color: #51afef;">)</span>
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-orgdd04c77" class="outline-3">
<h3 id="orgdd04c77"><span class="section-number-3">1.7.</span> Problem 7</h3>
<div class="outline-text-3" id="text-1-7">
<p>
<i>Skipped because it was UML, come back tmr</i>
</p>
</div>
</div>
<div id="outline-container-org922968b" class="outline-3">
<h3 id="org922968b"><span class="section-number-3">1.8.</span> Problem 8</h3>
<div class="outline-text-3" id="text-1-8">
<p>
<i>Requires a UML diagram, see PDF</i>
</p>
</div>
<div id="outline-container-orge0a055c" class="outline-4">
<h4 id="orge0a055c"><span class="section-number-4">1.8.1.</span> Answer</h4>
<div class="outline-text-4" id="text-1-8-1">
<p>
return super.getPreptime() + Topping.getPrepTime;
</p>
</div>
</div>
</div>
<div id="outline-container-org2341c53" class="outline-3">
<h3 id="org2341c53"><span class="section-number-3">1.9.</span> Problem 9</h3>
<div class="outline-text-3" id="text-1-9">
<p>
Considering what you know about the internal implementation of ArrayList in Java, how many objects
are created in the following lines of code?
</p>
<div class="org-src-container">
<pre class="src src-java"><span style="color: #ECBE7B;">ArrayList</span><span style="color: #51afef;">&lt;</span><span style="color: #ECBE7B;">Wizard</span><span style="color: #51afef;">&gt;</span> <span style="color: #dcaeea;">slytherin</span> = <span style="color: #51afef;">new</span> <span style="color: #ECBE7B;">Arraylist</span><span style="color: #51afef;">&lt;</span><span style="color: #ECBE7B;">Wizard</span><span style="color: #51afef;">&gt;()</span>;
slytherin.add<span style="color: #51afef;">(</span><span style="color: #51afef;">new</span> <span style="color: #ECBE7B;">Wizard</span><span style="color: #c678dd;">(</span><span style="color: #da8548; font-weight: bold;">18</span>,&#8221;Draco&#8221;<span style="color: #c678dd;">)</span><span style="color: #51afef;">)</span>;
<span style="color: #ECBE7B;">Integer</span> <span style="color: #dcaeea;">age</span> = <span style="color: #da8548; font-weight: bold;">180</span>;
slytherin.add<span style="color: #51afef;">(</span><span style="color: #51afef;">new</span> <span style="color: #ECBE7B;">Wizard</span><span style="color: #c678dd;">(</span>age, &#8220;youknowwho&#8221;<span style="color: #c678dd;">)</span><span style="color: #51afef;">)</span>;
</pre>
</div>
</div>
<div id="outline-container-orge6e1c39" class="outline-4">
<h4 id="orge6e1c39"><span class="section-number-4">1.9.1.</span> Answer</h4>
<div class="outline-text-4" id="text-1-9-1">
<p>
Assuming everything about ArrayLists (missed this lecture), I would assume there is an object of ArrayList, a head and a tail. It also has the object within the list, so 4 in total.
</p>
</div>
</div>
</div>
<div id="outline-container-org0549e08" class="outline-3">
<h3 id="org0549e08"><span class="section-number-3">1.10.</span> Problem 10</h3>
<div class="outline-text-3" id="text-1-10">
<p>
Using the method above, fill in the missing expressions/statements below for a method in SLinkedList
that takes no inputs, traverses the list, and swaps pairs of elements. For example, if the list had the
following elements A B C D E F G, then after the method has been executed, the list will contain the
elements in the following order B A D C F E G. The method should work no matter the size of the list.
Note that the method does not return anything, it just performs all the swaps. The time complexity
for this method should be O(n), where n is the number of elements in the list (i.e. the number of basic
steps to execute is proportional to the number of elements in the list).
</p>
<div class="org-src-container">
<pre class="src src-java"><span style="color: #51afef;">public</span> <span style="color: #ECBE7B;">void</span> <span style="color: #c678dd;">swapPairs</span><span style="color: #51afef;">(){</span>
        <span style="color: #ECBE7B;">SNode</span> <span style="color: #dcaeea;">node</span> = <span style="color: #51afef;">this</span>.head;
        <span style="color: #51afef;">while</span> <span style="color: #c678dd;">(</span> ***BLANK1*** <span style="color: #c678dd;">)</span> <span style="color: #c678dd;">{</span>
                ***BLANK2***
                ***BLANK3***
        <span style="color: #c678dd;">}</span>
<span style="color: #51afef;">}</span>
</pre>
</div>
</div>
