Comp250/midterm-review.org
*** Answer
a. BLANK1 implementation below
   #+BEGIN_SRC java
this.node.next != null
   #+END_SRC
 b. BLANK2 implementation below
   #+BEGIN_SRC java
this.swap (node, node.next);

   #+END_SRC
 c. BLANK3 implementation below
   #+BEGIN_SRC java
node = node.next.next;
   #+END_SRC

** Problem 11
/See problem on PDF, definetly took creative liberty with my answer/

1. *d.next.next.prev* is the second to last element, which is set to the current D (Diane is erased, Todd is both *D* and *d.next*)
2. *d.next* is set equal to *d.next.next*, which is the final element. This is essentially cutting the list short at 3 elements, erasing the last element which will get cleaned up by garbage collection
3. D is set to the element of what is now the final elemnent (2nd index), so Mr. PeanutButter. The list is now "Bojack" -> "Mr. PeanutButter" -> "Mr. PeanutButter"


** Problem 12
Consider the following pseudocode for a sorting algorithm (please remember that when writing pseu-
docode both bounds of a loop are included):
#+BEGIN_SRC java
sorted = false
start = 0
end = list.length
while (!sorted){
        sorted = true
        for j from start to end-2{
                if (list[j] > list[j+1]){
                        swap(list[j],list[j+1])
                        sorted = false
                }
        }
        // line_1
        if (sorted)
                break

        end--

        for j from end-2 to start {
                if (list[j] > list[j+1]){
                        swap(list[j],list[j+1])
                        sorted = false
                }
        }
        start++
}
// line_2
#+END_SRC

*** Answer
a. [0, 4, 5, 8, 3, 2, 1]
b. [0, 1, 2, 3, 4, 5, 8, 9]

** Problem 13
Consider the following pseudocode for selection sort:
#+BEGIN_SRC java
for delim from 0 to N-2 {
        min = delim
        for i from delim+1 to N-1 {
                if(list[i] < list[min]) {
                        min = i
                }
        }
        if(min != delim) {
                swap(list[min], list[delim])
        }
}
#+END_SRC
(a) Assuming you would like to sort the list [1, 5, 3, 9, 2, 6, 4]. What is the state of the list after 4
passes (i.e. iterations of the outer loop) ?
(b) How many total swaps will the algorithm perform to sort the list mentioned above?


*** Answer
a. [1, 2, 3, 4, 5, 6, 9]
b. 4 swaps, but the algorithm has an time efficiency of o(n^2), meaning it will loop through the array twice per index





