Comp250/midterm-review.html
<div id="outline-container-org98b4a45" class="outline-4">
<h4 id="org98b4a45"><span class="section-number-4">1.10.1.</span> Answer</h4>
<div class="outline-text-4" id="text-1-10-1">
<ol class="org-ol">
<li><p>
BLANK1 implementation below
</p>
<div class="org-src-container">
<pre class="src src-java"><span style="color: #51afef;">this</span>.node.next != <span style="color: #a9a1e1;">null</span>
</pre>
</div>
<ol class="org-ol">
<li><p>
BLANK2 implementation below
</p>
<div class="org-src-container">
<pre class="src src-java"><span style="color: #51afef;">this</span>.swap <span style="color: #51afef;">(</span><span style="color: #ECBE7B;">node</span>, node.<span style="color: #ECBE7B;">next</span><span style="color: #51afef;">)</span>;

</pre>
</div></li>
<li><p>
BLANK3 implementation below
</p>
<div class="org-src-container">
<pre class="src src-java">node = node.next.next;
</pre>
</div></li>
</ol></li>
</ol>
</div>
</div>
</div>
<div id="outline-container-orgbf943eb" class="outline-3">
<h3 id="orgbf943eb"><span class="section-number-3">1.11.</span> Problem 11</h3>
<div class="outline-text-3" id="text-1-11">
<p>
<i>See problem on PDF, definetly took creative liberty with my answer</i>
</p>

<ol class="org-ol">
<li><b>d.next.next.prev</b> is the second to last element, which is set to the current D (Diane is erased, Todd is both <b>D</b> and <b>d.next</b>)</li>
<li><b>d.next</b> is set equal to <b>d.next.next</b>, which is the final element. This is essentially cutting the list short at 3 elements, erasing the last element which will get cleaned up by garbage collection</li>
<li>D is set to the element of what is now the final elemnent (2nd index), so Mr. PeanutButter. The list is now &ldquo;Bojack&rdquo; -&gt; &ldquo;Mr. PeanutButter&rdquo; -&gt; &ldquo;Mr. PeanutButter&rdquo;</li>
</ol>
</div>
</div>
<div id="outline-container-org1abdb04" class="outline-3">
<h3 id="org1abdb04"><span class="section-number-3">1.12.</span> Problem 12</h3>
<div class="outline-text-3" id="text-1-12">
<p>
Consider the following pseudocode for a sorting algorithm (please remember that when writing pseu-
docode both bounds of a loop are included):
</p>
<div class="org-src-container">
<pre class="src src-java">sorted = <span style="color: #a9a1e1;">false</span>
start = <span style="color: #da8548; font-weight: bold;">0</span>
end = list.length
<span style="color: #51afef;">while</span> <span style="color: #51afef;">(</span><span style="color: #51afef; font-weight: bold;">!</span>sorted<span style="color: #51afef;">){</span>
        sorted = <span style="color: #a9a1e1;">true</span>
        <span style="color: #51afef;">for</span> j from start to end-<span style="color: #da8548; font-weight: bold;">2</span><span style="color: #c678dd;">{</span>
                <span style="color: #51afef;">if</span> <span style="color: #98be65;">(</span>list<span style="color: #a9a1e1;">[</span>j<span style="color: #a9a1e1;">]</span> &gt; list<span style="color: #a9a1e1;">[</span>j+<span style="color: #da8548; font-weight: bold;">1</span><span style="color: #a9a1e1;">]</span><span style="color: #98be65;">){</span>
                        swap<span style="color: #a9a1e1;">(</span>list<span style="color: #51afef;">[</span>j<span style="color: #51afef;">]</span>,list<span style="color: #51afef;">[</span>j+<span style="color: #da8548; font-weight: bold;">1</span><span style="color: #51afef;">]</span><span style="color: #a9a1e1;">)</span>
                        sorted = <span style="color: #a9a1e1;">false</span>
                <span style="color: #98be65;">}</span>
        <span style="color: #c678dd;">}</span>
        <span style="color: #5B6268;">// </span><span style="color: #5B6268;">line_1</span>
        <span style="color: #51afef;">if</span> <span style="color: #c678dd;">(</span>sorted<span style="color: #c678dd;">)</span>
                <span style="color: #51afef;">break</span>

        end--

        <span style="color: #51afef;">for</span> j from end-<span style="color: #da8548; font-weight: bold;">2</span> to start <span style="color: #c678dd;">{</span>
                <span style="color: #51afef;">if</span> <span style="color: #98be65;">(</span>list<span style="color: #a9a1e1;">[</span>j<span style="color: #a9a1e1;">]</span> &gt; list<span style="color: #a9a1e1;">[</span>j+<span style="color: #da8548; font-weight: bold;">1</span><span style="color: #a9a1e1;">]</span><span style="color: #98be65;">){</span>
                        swap<span style="color: #a9a1e1;">(</span>list<span style="color: #51afef;">[</span>j<span style="color: #51afef;">]</span>,list<span style="color: #51afef;">[</span>j+<span style="color: #da8548; font-weight: bold;">1</span><span style="color: #51afef;">]</span><span style="color: #a9a1e1;">)</span>
                        sorted = <span style="color: #a9a1e1;">false</span>
                <span style="color: #98be65;">}</span>
        <span style="color: #c678dd;">}</span>
        start++
<span style="color: #51afef;">}</span>
<span style="color: #5B6268;">// </span><span style="color: #5B6268;">line_2</span>
</pre>
</div>
</div>
<div id="outline-container-orgd484b86" class="outline-4">
<h4 id="orgd484b86"><span class="section-number-4">1.12.1.</span> Answer</h4>
<div class="outline-text-4" id="text-1-12-1">
<ol class="org-ol">
<li>[0, 4, 5, 8, 3, 2, 1]</li>
<li>[0, 1, 2, 3, 4, 5, 8, 9]</li>
</ol>
</div>
</div>
</div>
<div id="outline-container-orgb8d8bcc" class="outline-3">
<h3 id="orgb8d8bcc"><span class="section-number-3">1.13.</span> Problem 13</h3>
<div class="outline-text-3" id="text-1-13">
<p>
Consider the following pseudocode for selection sort:
</p>
<div class="org-src-container">
<pre class="src src-java"><span style="color: #51afef;">for</span> delim from <span style="color: #da8548; font-weight: bold;">0</span> to N-<span style="color: #da8548; font-weight: bold;">2</span> <span style="color: #51afef;">{</span>
        min = delim
        <span style="color: #51afef;">for</span> i from delim+<span style="color: #da8548; font-weight: bold;">1</span> to N-<span style="color: #da8548; font-weight: bold;">1</span> <span style="color: #c678dd;">{</span>
                <span style="color: #51afef;">if</span><span style="color: #98be65;">(</span>list<span style="color: #a9a1e1;">[</span>i<span style="color: #a9a1e1;">]</span> &lt; list<span style="color: #a9a1e1;">[</span>min<span style="color: #a9a1e1;">]</span><span style="color: #98be65;">)</span> <span style="color: #98be65;">{</span>
                        min = i
                <span style="color: #98be65;">}</span>
        <span style="color: #c678dd;">}</span>
        <span style="color: #51afef;">if</span><span style="color: #c678dd;">(</span>min != delim<span style="color: #c678dd;">)</span> <span style="color: #c678dd;">{</span>
                swap<span style="color: #98be65;">(</span>list<span style="color: #a9a1e1;">[</span>min<span style="color: #a9a1e1;">]</span>, list<span style="color: #a9a1e1;">[</span>delim<span style="color: #a9a1e1;">]</span><span style="color: #98be65;">)</span>
        <span style="color: #c678dd;">}</span>
<span style="color: #51afef;">}</span>
</pre>
</div>
<p>
(a) Assuming you would like to sort the list [1, 5, 3, 9, 2, 6, 4]. What is the state of the list after 4
passes (i.e. iterations of the outer loop) ?
(b) How many total swaps will the algorithm perform to sort the list mentioned above?
</p>
</div>
<div id="outline-container-org29e5d73" class="outline-4">
<h4 id="org29e5d73"><span class="section-number-4">1.13.1.</span> Answer</h4>
<div class="outline-text-4" id="text-1-13-1">
<ol class="org-ol">
<li>[1, 2, 3, 4, 5, 6, 9]</li>
<li>4 swaps, but the algorithm has an time efficiency of o(n<sup>2</sup>), meaning it will loop through the array twice per index</li>
</ol>
</div>
</div>
</div>
</div>
</div>
</body>
</html>
